alpha_0.4/0/UDDES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/







FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      UDDES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
8940
(
( -0.003574680071 -0.006671831943 1.997346044e-05 )
( -0.003340051044 -0.006376585923 9.23265543e-06 )
( -0.003674972802 -0.006664240733 2.694639625e-05 )
( -0.003333957633 -0.006365813781 8.893093764e-06 )
( -0.00352790649 -0.006532944739 1.956377673e-05 )
( -0.003761982778 -0.006671188399 3.179872147e-05 )
( -0.003692847211 -0.006685800385 3.064522389e-05 )
( -0.003494211007 -0.006409607828 1.704568967e-05 )
...
)
;

boundaryField
{
    hill
    {
        type            calculated;
        value           uniform ( 0 0 0 );
    }
    top-wall
    {
        type            calculated;
        value           uniform ( 0 0 0 );
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 );
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
